In [1]:
import pandas as pd

In [2]:
print(pd.__version__)

2.2.2

In [3]:
# 파일에서 데이터프레임을 생성
# csv와 tsv 차이 때문에 sep을 한다?
dataframe = pd.read_csv('../doit_pandas-master/data/gapminder.tsv', sep = '\t')

In [5]:
df = pd.DataFrame()

In [6]:
df = pd.DataFrame(
    data = {},
    index = [],
    columns = []
)

In [8]:
# 클래스를 통해 직접 데이터프레임 생성
df = pd.DataFrame(
    data = {'Occupation':['Chemist', 'Statistician'],
           'Born' : ['1920-07-25', '1876-06-13'],
           'Age' : [27, 61]},
    index = ['Rosaline Franklin', 'William Gosset'],
    columns = ['Occupation', 'Born', 'Age']
)

In [9]:
print(df)

                     Occupation        Born  Age
Rosaline Franklin       Chemist  1920-07-25   27
William Gosset     Statistician  1876-06-13   61

In [4]:
print(dataframe.head())

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [ ]:
#------------------------------------------------------------------------------------------------------------------------------

In [10]:
import pandas as pd

In [11]:
df = pd.read_csv('../doit_pandas-master/data/gapminder.tsv', sep = '\t')

In [12]:
df.shape

(1704, 6)

In [13]:
scientists = pd.read_csv('../doit_pandas-master/data/scientists.csv')

In [14]:
# 8명의 자료가 있고 5개의 정보가 있다
scientists.shape

(8, 5)

In [17]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation'], dtype='object')

In [15]:
scientists.index

RangeIndex(start=0, stop=8, step=1)

In [16]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [20]:
scientists['Age'].mean()

np.float64(59.125)

In [21]:
# 1 > 8
scientists['Age']>scientists['Age'].mean()    # broadcasting 브로드캐스팅

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [22]:
scientists[scientists['Age']>scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [23]:
print(scientists['Born'].dtype)

object

In [55]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 0 to 7
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         7 non-null      object
 1   Born         7 non-null      object
 2   Died         7 non-null      object
 3   Age          7 non-null      int64
 4   Occupation   7 non-null      object
 5   born_at      7 non-null      datetime64[ns]
 6   died_at      7 non-null      datetime64[ns]
 7   age_days_dt  7 non-null      timedelta64[ns]
dtypes: datetime64[ns](2), int64(1), object(4), timedelta64[ns](1)
memory usage: 504.0+ bytes

In [24]:
born_datetime = pd.to_datetime(scientists['Born'],format='%Y-%m-%d')#pandas 메소드 중 하나, 모듈의 사용법 학습중

In [25]:
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [59]:
died_datetime = pd.to_datetime(scientists['Died'], format = '%Y-%m-%d')

In [60]:
print(died_datetime)

0   1958-04-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [61]:
scientists['born_at'] = born_datetime

In [62]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 0 to 7
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         7 non-null      object
 1   Born         7 non-null      object
 2   Died         7 non-null      object
 3   Age          7 non-null      int64
 4   Occupation   7 non-null      object
 5   born_at      7 non-null      datetime64[ns]
 6   died_at      7 non-null      datetime64[ns]
 7   age_days_dt  7 non-null      timedelta64[ns]
dtypes: datetime64[ns](2), int64(1), object(4), timedelta64[ns](1)
memory usage: 504.0+ bytes

In [63]:
scientists.shape

(7, 8)

In [64]:
scientists.head(1)

,Name,Born,Died,Age,Occupation,born_at,died_at,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days

In [65]:
scientists['died_at'] = died_datetime

In [66]:
scientists.shape

(7, 8)

In [39]:
scientists['age_days_dt'] = scientists['died_at']-scientists['born_at']

In [35]:
scientists

,Name,Born,Died,Age,Occupation,born_at
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30

In [36]:
scientists.to_csv('./data/scientists.csv')

In [37]:
scientists.to_csv('./data/scientists.tsv', sep ='\t')

In [40]:
# C(생성, 추가) R(전체, 부분) U(수정 : 데이터, 구조) D(삭제)

In [52]:
scientists.head(3)

,Name,Born,Died,Age,Occupation,born_at,died_at,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days

In [42]:
scientists.drop('Age', axis = 1)

,Name,Born,Died,Occupation,born_at,died_at,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

In [44]:
scientists.drop(1, axis=0)

,Name,Born,Died,Age,Occupation,born_at,died_at,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [47]:
manu_1 = scientists.drop(1)

In [49]:
manu_1

,Name,Born,Died,Age,Occupation,born_at,died_at,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [50]:
scientists.drop(1, inplace=True)

In [51]:
scientists

,Name,Born,Died,Age,Occupation,born_at,died_at,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [53]:
new_row_df = pd.DataFrame(
    [['n1', 'n2', 'n3', 'n4']],
    columns = ['A', 'B', 'C', 'D']
)

In [54]:
new_row_df

    A   B   C   D
0  n1  n2  n3  n4